# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/services'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install Binaries
brew 'vim'
brew 'git'
brew 'bazaar'
brew 'cmake'
brew 'eigen'
brew 'gmp'
brew 'mpfr'
brew 'libmpc'
brew 'isl'
brew 'gcc'
brew 'gdbm'
brew 'go'
brew 'gowsdl'
brew 'hugo'
brew 'ilmbase'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'libyaml'
brew 'mackup'
brew 'mercurial'
brew 'openssl'
brew 'mongodb'
brew 'nsq'
brew 'pkg-config'
brew 'openexr'
brew 'p7zip'
brew 'perl'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'postgresql'
brew 'protobuf'
brew 'protobuf-c'
brew 'ruby'
brew 'unrar'

# Apps
cask '1password'
cask 'alfred'
cask 'arduino'
cask 'atom'
cask 'arq'
#cask 'airdisplay'
cask 'carbon-copy-cloner'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'filezilla'
cask 'flux'
cask 'garmin-basecamp'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-drive'
cask 'logitech-myharmony'
cask 'mendeley-desktop'
cask 'microsoft-office'
cask 'nvalt'
cask 'postgres'
cask 'postico'
cask 'powerphotos'
#cask 'powertunes'
cask 'skype'
cask 'sqlitebrowser'
cask 'synalyze-it-pro'
cask 'sonos'
cask 'vlc'

# Fonts
cask 'font-inconsolata'
